---
kind: method
id: M:Autodesk.Revit.DB.View.HasDetailLevel
zh: 视图
source: html/b9f63f88-a18d-5b96-3338-f55685e2a229.htm
---
# Autodesk.Revit.DB.View.HasDetailLevel Method

**中文**: 视图

Check if the view has a Detail Level property

## Syntax (C#)
```csharp
public bool HasDetailLevel()
```

## Returns
True if the view has a Detail Level, false otherwise